Revit 2026 API

# ViewPlanSetViewRange Method

---

Sets the view range.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetViewRange(
	PlanViewRange planViewRange
)
```
```vb
Public Sub SetViewRange (
	planViewRange As PlanViewRange
)
```
```cpp
public:
void SetViewRange(
	PlanViewRange^ planViewRange
)
```
```fsharp
member SetViewRange :
        planViewRange : PlanViewRange -> unit
```

#### Parameters

planViewRange PlanViewRange
     The view range.

| Exception | Condition |
| --- | --- |
| ArgumentException | Plan view range is not valid. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ViewPlan Class

Autodesk.Revit.DB Namespace